tap "homebrew/bundle"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "pkgxdev/made"
tap "pulumi/tap"
tap "seatedro/glimpse"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "autoconf"
brew "python@3.12"
brew "awscli"
brew "azure-cli"
brew "caddy"
brew "glib"
brew "cloudflared"
brew "cmake"
brew "freetds"
brew "php"
brew "composer"
brew "direnv"
brew "wxwidgets"
brew "erlang"
brew "elixir-ls"
brew "fd"
brew "flyctl"
brew "fnm"
brew "harfbuzz"
brew "fop"
brew "gawk"
brew "gcc"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gradle"
brew "graphicsmagick"
brew "helix"
brew "imagemagick"
brew "jq"
brew "openblas"
brew "julia"
brew "kdoctor"
brew "kotlin"
brew "libxslt"
brew "libyaml"
brew "llvm@18"
brew "lua"
brew "luarocks"
brew "mise"
brew "nasm"
brew "neonctl"
brew "opam"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "postgresql@15"
brew "railway"
brew "ripgrep"
brew "rlwrap"
brew "rustup"
brew "shellcheck"
brew "socat"
brew "tlrc"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "zellij"
brew "pkgxdev/made/pkgx"
brew "pulumi/tap/pulumi"
brew "seatedro/glimpse/glimpse"
brew "sst/tap/sst"
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"
cask "1password-cli"
cask "git-credential-manager"
cask "jordanbaird-ice"
cask "orbstack"
vscode "1password.op-vscode"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hbenl.vscode-test-explorer"
vscode "mohsen1.prettify-json"
vscode "ms-vscode.test-adapter-converter"
vscode "oven.bun-vscode"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
