# Taps
tap "seatedro/glimpse"
tap "sst/tap"
tap "pulumi/tap"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
tap "nikitabobko/tap"
tap "jesseduffield/lazydocker"

brew "git-lfs" # git large files
brew "protobuf" # Protocol Buffer
brew "yazi" # CLI file manager
brew "ffmpeg"
brew "sevenzip" # archives
brew "poppler" # PDF preview
brew "imagemagick" # Images
brew "jesseduffield/lazydocker/lazydocker" # TUI for docker
brew "neovim"
brew "direnv" # env vars hooks
brew "fzf" # fuzzy find
brew "bat" # better cat
brew "cmake"
brew "gh" # GitHub CLI
brew "nushell"
brew "wireshark"
brew "starship" # Fish prompt
brew "uv" # Python package and project manager
brew "duckdb" # in-process analytical DB
brew "lazygit" # TUI for git
brew "fastfetch"
brew "eza"
brew "zoxide" # cd with history
brew "duti"
brew "binutils"
brew "pnpm" # Nodejs package manager
brew "fnm" # Nodejs versions manager
brew "seatedro/glimpse/glimpse" # tokenize files to put into the LLM
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "autoconf"
brew "awscli"
brew "azure-cli"
brew "python@3.12"
brew "glib"
brew "cloudflared"
brew "cmake"
brew "php"
brew "composer"
brew "wxwidgets"
brew "fd"
brew "flyctl"
brew "openjdk"
brew "fop"
brew "gawk"
brew "gcc"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gradle"
brew "jq"
brew "openblas"
brew "libxslt"
brew "llvm@18"
brew "lua"
brew "opam"
brew "imagemagick"
brew "graphicsmagick"
brew "parallel"
brew "pinentry-mac"
brew "postgresql@15"
brew "ripgrep"
brew "rlwrap"
brew "rustup"
brew "socat"
brew "tlrc"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "pulumi/tap/pulumi"
brew "sst/tap/sst"
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"

cask "1password-cli"
cask "obs"
cask "reminders-menubar"
cask "nikitabobko/tap/aerospace"
cask "jordanbaird-ice"
cask "ghostty"
cask "monitorcontrol"
