tap "homebrew/bundle"
tap "pkgxdev/made"
tap "stripe/stripe-cli"
brew "openssl@3"
brew "autoconf"
brew "bat"
brew "cmake"
brew "exa"
brew "fd"
brew "flyctl"
brew "fnm"
brew "fop"
brew "fzf"
brew "gawk"
brew "gh"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "jq"
brew "julia"
brew "libxslt"
brew "lua"
brew "luarocks"
brew "oha"
brew "opam"
brew "parallel"
brew "php"
brew "pinentry-mac"
brew "postgresql@15"
brew "railway"
brew "ripgrep"
brew "socat"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "wxwidgets"
brew "pkgxdev/made/pkgx"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
vscode "13xforever.language-x86-64-assembly"
vscode "adpyke.vscode-sql-formatter"
vscode "astro-build.astro-vscode"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dan-c-underwood.arm"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "k--kato.intellij-idea-keybindings"
vscode "mattpocock.ts-error-translator"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tobiasalthoff.atom-material-theme"
vscode "uctakeoff.vscode-counter"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "withfig.fig"
vscode "xsro.masm-tasm"
vscode "xsro.vscode-dosbox"
vscode "ZixuanChen.vitest-explorer"
