tap "homebrew/bundle"
tap "libsql/sqld"
tap "pkgxdev/made"
tap "pulumi/tap"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "autoconf"
brew "sqlite"
brew "awscli"
brew "bat"
brew "python@3.12"
brew "glib"
brew "clifm"
brew "cloudflared"
brew "cmake"
brew "direnv"
brew "wxwidgets"
brew "elixir-ls"
brew "exa"
brew "fd"
brew "flyctl"
brew "fnm"
brew "openjdk"
brew "fop"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gradle"
brew "helix"
brew "jq"
brew "julia"
brew "kdoctor"
brew "kotlin"
brew "libpq"
brew "libxslt"
brew "lua"
brew "luarocks"
brew "nasm"
brew "oha"
brew "opam"
brew "parallel"
brew "php"
brew "pinentry-mac"
brew "postgresql@15"
brew "railway"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "socat"
brew "tlrc"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "zellij"
brew "pkgxdev/made/pkgx"
brew "pulumi/tap/pulumi"
brew "sst/tap/sst"
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"
cask "1password-cli"
cask "jordanbaird-ice"
cask "orbstack"
cask "wezterm"
vscode "13xforever.language-x86-64-assembly"
vscode "adpyke.vscode-sql-formatter"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "jakebecker.elixir-ls"
vscode "k--kato.intellij-idea-keybindings"
vscode "mattpocock.ts-error-translator"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobiasalthoff.atom-material-theme"
vscode "uctakeoff.vscode-counter"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "xsro.masm-tasm"
vscode "xsro.vscode-dosbox"
vscode "zixuanchen.vitest-explorer"
