base
bat
cloud-init
eza
fd
fish
gcc
git
grub
haveged
inetutils
iotop
jq
linux
linux-firmware
lsof
make
man-db
man-pages
mtr
nano
net-tools
openssh
ripgrep
sudo
sysstat
tmux
unzip
vim
wget
which
whois
